{"translation-revision-date":"2025-10-06 12:52:59+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=3; plural=(n % 10 == 1 && n % 100 != 11) ? 0 : ((n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14)) ? 1 : 2);","lang":"ru"},"Please try the %1$sDirect Conversion%2$s method if you don’t have server access, or %3$scontact support%4$s for further assistance.":["Пожалуйста, попробуйте метод %1$sПрямой конверсии%2$s, если у вас нет доступа к серверу, или %3$sсвяжитесь с поддержкой%4$s за дополнительной помощью."],"Activate the Next-Gen Formats feature with a single click; no server configuration required.":["Активируйте функцию Next-Gen Formats одним щелчком мыши; настройка сервера не требуется."],"This stage is already completed.":["Эта стадия уже завершена."],"Setup":["Установка"],"Finishing setup…":["Завершающая установка…"],"Check status":["Проверить статус"],"Quit":["Выход"],"Quit setup":["Выход из установки"],"Something went wrong with the request.":["Что-то пошло не так с запросом."],"Step %s":["Шаг %s"],"Convert now":["Преобразовать сейчас"],"Convert Images to WebP":["Преобразование изображений в WebP"],"Next, click Check Status button below to see if it's working.":["Далее нажмите кнопку Проверить статус, чтобы проверить, работает ли он."],"Get Support.":["Получить поддержку."],"Still having trouble?":["У вас все еще проблемы?"],"NGINX":["NGINX"],"Apache":["Apache"],"WebP conversion is active and working well. Your hosting has automatically pre-configured the conversion for you. The only step for you would be to create WebP images below.":["Преобразование WebP активно и хорошо работает. Ваш хостинг автоматически настроил преобразование для вас. Единственным шагом для вас будет создание изображений WebP ниже."],"Since your site is hosted with WPMU DEV, we already have done the configurations steps for you. The only step for you would be to create WebP images below.":["Поскольку ваш сайт размещен на WPMU DEV, мы уже выполнили шаги по настройке за вас. Единственный шаг для вас - создать изображения WebP ниже."],"We noticed the Amazon S3 Integration is enabled. Offloaded images will not be served in WebP format, but Smush will create local WebP copies of all images. If this is undesirable, you can quit the setup.":["Мы заметили, что интеграция с Amazon S3 включена. Выгруженные изображения не будут передаваться в формате WebP, но Smush создаст локальные WebP-копии всех изображений. Если это нежелательно, вы можете выйти из настройки."],"The rules have been applied successfully.":["Правила успешно применены."],"Finish Setup":["Установка завершена"],"The following configurations are for NGINX servers. If you do not have access to your NGINX config files you will need to contact your hosting provider to make these changes.":["Следующие конфигурации предназначены для серверов NGINX. Если у вас нет доступа к вашим файлам конфигурации NGINX, вам нужно будет связаться с вашим хостинг-провайдером, чтобы внести эти изменения."],"Add Rules":["Добавить правила"],"Choose Server Type":["Выбрать тип сервера"],"Fix “Serve images in next-gen format\" Google PageSpeed recommendation.":["Исправьте рекомендацию Google PageSpeed \"Используйте современные форматы изображений\"."],"Manual":["Вручную"],"Automatic":["Автоматически"],"Copy the generated code below and paste it at the top of your .htaccess file (before any existing code) in the root directory.":["Скопируйте сгенерированный ниже код и вставьте его в начало файла .htaccess (перед любым существующим кодом) в корневом каталоге."],"If you are unable to get the automated method working, follow these steps:":["Если вам не удается заставить работать автоматический метод, выполните следующие действия:"],"Local WebP":["Локальный WebP"],"Smush WebP":["Обработка WebP"],"Reload NGINX.":["Перезагрузка NGINX."],"Copy the generated code found below and paste it inside your http or server blocks.":["Скопируйте сгенерированный код, указанный ниже, и вставьте его в свои http или серверные блоки."],"Insert the following in the server context of your configuration file (usually found in \/etc\/nginx\/sites-available). “The server context” refers to the part of the configuration that starts with “server {” and ends with the matching “}”.":["Вставьте следующее в контекст сервера вашего конфигурационного файла (обычно находится в \/etc\/nginx\/sites-available). \"Контекст сервера\" относится к той части конфигурации, которая начинается с \"server {\" и заканчивается соответствующим \"}\"."],"If you don't know where those files are, or you aren't able to reload Apache, you would need to consult with your hosting provider or a system administrator who has access to change the configuration of your server.":["Если вы не знаете, где находятся эти файлы, или не можете перезагрузить Apache, вам необходимо проконсультироваться с хостинг-провайдером или системным администратором, имеющим доступ к изменению конфигурации вашего сервера."],"Reload Apache.":["Перезагрузка Apache."],"Look for your site in the file and find the line that starts with <Directory> - add the code above that line and into that section and save the file.":["Найдите свой сайт в файле и найдите строку, которая начинается с <Directory> - добавьте код выше этой строки и в эту секцию и сохраните файл."],"If .htaccess does not work, and you have access to vhosts.conf or httpd.conf, try this:":["Если .htaccess не работает, и у вас есть доступ к vhosts.conf или httpd.conf, попробуйте следующее:"],"Troubleshooting":["Устранение неполадок"],"Apply rules":["Применить правила"],"Please note: Some servers have both Apache and NGINX software which may not begin serving WebP images after applying the .htaccess rules. If errors occur after applying the rules, we recommend adding NGINX rules manually.":["Обратите внимание: на некоторых серверах установлено программное обеспечение Apache и NGINX, которое может не начать обслуживать изображения WebP после применения правил .htaccess. Если после применения правил возникают ошибки, мы рекомендуем добавлять правила NGINX вручную."],"Smush can automatically apply WebP conversion rules for Apache servers by writing to your .htaccess file. Alternatively, switch to Manual to apply these rules yourself.":["Smush может автоматически применять правила преобразования WebP для серверов Apache, записывая их в ваш файл .htaccess. В качестве альтернативы переключитесь на Ручной, чтобы применить эти правила самостоятельно."],"We've automatically detected your server type is %s. If this is incorrect, manually select your server type to generate the relevant rules and instructions.":["Мы автоматически определили тип вашего сервера %s. Если это неверно, выберите вручную тип вашего сервера, чтобы сгенерировать соответствующие правила и инструкции."],"Choose your server type. If you don’t know this, please contact your hosting provider.":["Выберите тип вашего сервера. Если вы этого не знаете, обратитесь к хостинг-провайдеру."],"Server Type":["Тип сервера"],"Previous":["Предыдущий"],"Finish":["Готово"],"Next":["Далее"],"Pro":["Pro"]}},"comment":{"reference":"app\/assets\/js\/smush-react-webp.js"}}